// Задача 39: 
// Напишите программу, которая перевернёт одномерный массив (последний элемент будет на первом месте, а первый - на последнем и т.д.)
// [1 2 3 4 5] -> [5 4 3 2 1]
// [6 7 3 6] -> [6 3 7 6]

// Решение:
/* 
void InputArray(int[] array)
{
    for(int i = 0; i < array.Length; i++)
        array[i] = new Random().Next(0, 10); // [0, 199]
}


void ReleaseArray(int[] array)
{
    int temp = 0;
    for(int i = 0; i < array.Length / 2; i++)
    {
        temp = array[i];
        array[i] = array[array.Length - 1 - i];
        array[array.Length - 1 - i] = temp;
    }
}

Console.Clear();
Console.Write("Размер массива: ");
int n = Convert.ToInt32(Console.ReadLine());
int[] array = new int[n];
InputArray(array);
Console.WriteLine($"[{string.Join(", ", array)}]");
ReleaseArray(array);
Console.WriteLine($"[{string.Join(", ", array)}]");
 */

//________________________________________________________________________________________________________________________________________________________________________

// Задача 40: 
// Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать треугольник с сторонами такой длины.
// Теорема о неравенстве треугольника: каждая сторона треугольника меньше суммы двух других сторон

// Ввод элементов цикла с консоли:

// int[] size = Console.ReadLine().Split(" ").Select(x => int.Parse(x)).ToArray();
// Console.WriteLine($"[{string.Join(", ", size)}]");

// // "1 2 3 4 5"
// // "1", "2", "3", "4", "5"
// // 1, 2, 3, 4, 5
// // [1, 2, 3, 4, 5]
/* 
int[] size = Console.ReadLine().Split(" ").Select(x => int.Parse(x)).ToArray();
if (size[0] < size[1] + size[2] &&
    size[1] < size[0] + size[2] &&
    size[2] < size[1] + size[0])
    Console.WriteLine("yes");
else
    Console.WriteLine("no");
 */
 //________________________________________________________________________________________________________________________________________________________________________

// Задача 42: 
// Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3  -> 11
// 2  -> 10

// Решение:

/* 
Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
string res = String.Empty;

while (n > 0)
{
    res = Convert.ToString(n % 2) + res;
    n /= 2;
}
Console.Write(res);
*/

//________________________________________________________________________________________________________________________________________________________________________

// Задача 44: 
// Не используя рекурсию, выведите первые N чисел Фибоначчи. Первые два числа Фибоначчи: 0 и 1.
// Если N = 5 -> 0 1 1 2 3
// Если N = 3 -> 0 1 1
// Если N = 7 -> 0 1 1 2 3 5 8

// Решение:
/* 
Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
int x0 = 0;
int x1 = 1;
int x2 = x0 + x1;

for (int i =0; i < n; i++)
{
    Console.Write($"{x0} ");
    x2 = x0 + x1;
    x0 = x1;
    x1 = x2;
}
 */
//________________________________________________________________________________________________________________________________________________________________________

// Задача 45: 
// Напишите программу, которая будет создавать копию заданного массива с помощью поэлементного копирования.

// Решение:
/* 
void copy(int[] arr, int[] newArr) 
{
    for(int i = 0; i < arr.Length; i++) {
        newArr[i] = arr[i];
    }
}
int[] array = Console.ReadLine().Split(" ").Select(x => int.Parse(x)).ToArray();
int[] newArr = new int[array.Length];
copy(array, newArr);
Console.WriteLine($"[{string.Join(", ", array)}]");
Console.WriteLine($"[{string.Join(", ", newArr)}]");
 */

 //________________________________________________________________________________________________________________________________________________________________________

 // Домашнее задание:

//  Задача 41: 
// Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

// Решение:

/* 
Console.WriteLine("Введите произвольное количество чисел: ");
int[] size = Console.ReadLine().Split(" ").Select(x => int.Parse(x)).ToArray();
int sum = 0;
for (int i=0; i < size.Length; i++)
    if (size[i] > 0) sum++; 
Console.WriteLine($"Чисел больше 0 - {sum}");
 */


//________________________________________________________________________________________________________________________________________________________________________

// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2;
// значения b1, k1, b2 и k2 задаются пользователем.
// b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)

// Решение:
/* 
static void IntPoint (double b1, double b2, double k1, double k2)
{
    double x = -(b1-b2)/(k1-k2);
    double y = k2*(-(b1-b2)/(k1-k2))+b2;
    Console.WriteLine($"Точкв пересечения двух прямых имеет координаты: ({x}; {y})");
}
Console.WriteLine("Для нахождения точки пересечения прямых неоходимо ввести координаты:");
Console.Write("b1 = ");
int b1 = Convert.ToInt32(Console.ReadLine());
Console.Write("k1 = ");
int k1 = Convert.ToInt32(Console.ReadLine());
Console.Write("b2 = ");
int b2 = Convert.ToInt32(Console.ReadLine());
Console.Write("k2 = ");
int k2 = Convert.ToInt32(Console.ReadLine());
IntPoint (b1,b2,k1,k2);
 */
// y = k1*x + b1;
// y = k2*x + b2;

// Вычтем из первого уравнения второе

// y-y = k1*x + b1 - (k2*x + b2);
// y   = k2*x + b2;
//       =>                   
// 0   = (k1*x - k2*x) + (b1 - b2) => x*(k1-k2) + (b1-b2);
// y   =  k2*x + b2;
 
// Из первого уравнения найдем значение x

// x*(k1-k2) = -(b1-b2);
// y = k2*x + b2;
//       =>                  
// x = -(b1-b2) / (k1-k2);
// y = k2 * (-(b1-b2) / (k1-k2)) + b2;
 
//________________________________________________________________________________________________________________________________________________________________________